---
title: Cisco Switch ê¸°ë³¸ ì„¤ì •
author: G.G
date: 2025-01-08 09:00:00 +0900
categories: [Blog, Provisioning]
tags: [Provisioning, Cisco, NTP, SNMP, Banner, SCP, ACL, AAA Model]
---

## ğŸ“˜ ê°œìš”
Cisco ìŠ¤ìœ„ì¹˜ëŠ” ë„¤íŠ¸ì›Œí¬ì˜ ì¤‘ì‹¬ ì¥ë¹„ë¡œ, ë³´ì•ˆ ë° íš¨ìœ¨ì„±ì„ ë†’ì´ê¸° ìœ„í•´ ì´ˆê¸° ì„¤ì •ì„ ì‹ ì¤‘íˆ ìˆ˜í–‰í•´ì•¼ í•©ë‹ˆë‹¤. ì´ ë§¤ë‰´ì–¼ì€ ìŠ¤ìœ„ì¹˜ì˜ ê¸°ë³¸ ì„¤ì • í•­ëª©ê³¼ ë³´ì•ˆ ë° ê´€ë¦¬ì— í•„ìˆ˜ì ì¸ ì„¤ì • ë°©ë²•ì„ ì œê³µí•©ë‹ˆë‹¤.

## ì„¤ì • ìš”ì•½ í‘œ

| **êµ¬ë¶„**                     | **ëª…ë ¹ì–´**                                                                                       | **ì„¤ëª…**                                                                                            |
|-----------------------------|------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------|
| **í˜¸ìŠ¤íŠ¸ ì´ë¦„ ì„¤ì •**          | `hostname SW`                                                                                | ìŠ¤ìœ„ì¹˜ì˜ í˜¸ìŠ¤íŠ¸ ì´ë¦„ì„ `SW`ë¡œ ì„¤ì •.                                                               |
| **Enable ë¹„ë°€ë²ˆí˜¸ ì„¤ì •**      | `enable algorithm-type scrypt secret cisco`                                                 | Enable ëª¨ë“œ ë¹„ë°€ë²ˆí˜¸ë¥¼ Scrypt ì•Œê³ ë¦¬ì¦˜ì„ ì‚¬ìš©í•˜ì—¬ `cisco`ë¡œ ì„¤ì •.                                 |
| **ì‚¬ìš©ì ê³„ì • ìƒì„±**          | `username cisco privilege 15 algorithm-type scrypt secret cisco`                             | ì‚¬ìš©ì `cisco` ê³„ì •ì„ Privileged ëª¨ë“œë¡œ ìƒì„±.                                                    |
| **AAA ëª¨ë¸ ë¹„í™œì„±í™”**         | `no aaa new-model`                                                                           | AAA ëª¨ë¸ ë¹„í™œì„±í™”.                                                                               |
| **ë„ë©”ì¸ ì´ë¦„ ì¡°íšŒ ë¹„í™œì„±í™”** | `no ip domain-lookup`                                                                        | ì˜ëª»ëœ ëª…ë ¹ ì…ë ¥ ì‹œ DNS ì¡°íšŒë¥¼ ë°©ì§€.                                                             |
| **ì‹œê°„ëŒ€ ì„¤ì •**               | `clock timezone KST 9 0`                                                                     | ì‹œê°„ëŒ€ë¥¼ KSTë¡œ ì„¤ì •.                                                                              |
| **NTP ì„œë²„ ì¶”ê°€**             | `ntp server 216.239.35.x`                                                                    | NTP ì„œë²„ ì„¤ì •ìœ¼ë¡œ ì‹œê°„ ë™ê¸°í™”.                                                                   |
| **ë„ë©”ì¸ ì´ë¦„ ì„¤ì •**          | `ip domain-name infra.com`                                                                   | ìŠ¤ìœ„ì¹˜ì˜ ë„ë©”ì¸ ì´ë¦„ì„ ì„¤ì •.                                                                      |
| **SSH í™œì„±í™”**               | `crypto key generate rsa general-keys modulus 2048` <br> `ip ssh version 2` <br> `ip ssh time-out 120` | SSHë¥¼ í™œì„±í™”í•˜ê³  í‚¤ë¥¼ ìƒì„±í•˜ë©°, ì¸ì¦ íƒ€ì„ì•„ì›ƒì„ ì„¤ì •.                                             |
| **SCP í™œì„±í™”**               | `ip scp server enable`                                                                        | SCP íŒŒì¼ ì „ì†¡ í™œì„±í™”.                                                                             |
| **SNMP ì„¤ì •**                | `snmp-server community nms RO SNMP` <br> `ip access-list standard SNMP permit 10.1.1.100` | SNMP ì»¤ë®¤ë‹ˆí‹°ì™€ ACLì„ ì„¤ì •.                                                                       |
| **ë¡œê¹… ì„œë²„ ì„¤ì •**            | `logging host 10.1.1.100` <br> `logging trap debugging`                                       | ë¡œê¹… ì„œë²„ë¥¼ ì¶”ê°€í•˜ê³  ë””ë²„ê¹… ë ˆë²¨ ì„¤ì •.                                                            |
| **VTY ë¼ì¸ ì„¤ì •**             | `line vty 0 15` <br> `transport input ssh` <br> `login local` <br> `exec-timeout 5 0`        | SSHë§Œ í—ˆìš©í•˜ê³  5ë¶„ ë¹„í™œì„± ì‹œ íƒ€ì„ì•„ì›ƒ ì„¤ì •.                                                       |
| **SSH ê³µê°œ í‚¤ ë“±ë¡**          | `ip ssh pubkey-chain` <br> `username cisco` <br> `key-hash ssh-rsa [hash-value]`             | ê³µê°œ í‚¤ ì¸ì¦ì„ ìœ„í•œ ì‚¬ìš©ìì™€ í‚¤ ë“±ë¡.                                                             |
| **VLAN ì„¤ì •**                | `vlan 100` <br> `name Zone_10.1.1.0/24` <br> `interface Vlan100` <br> `ip address 10.1.1.10 255.255.255.0` | VLAN ìƒì„± ë° IP ì„¤ì •.                                                                             |
| **ê¸°ë³¸ ê²Œì´íŠ¸ì›¨ì´ ì„¤ì •**       | `ip default-gateway 10.1.255.1`                                                              | ë””í´íŠ¸ ê²Œì´íŠ¸ì›¨ì´ë¥¼ ì„¤ì •.                                                                         |
| **í¬íŠ¸ ì±„ë„ ì„¤ì •**            | `interface range Gi1/0/47 - 48` <br> `switchport mode trunk` <br> `channel-group 1 mode active` | íŠ¸ë í¬ í¬íŠ¸ë¥¼ ë³¸ë”©í•˜ì—¬ Port-Channelë¡œ ì„¤ì •.                                                       |
| **í¬íŠ¸ ì„¤ëª… ì¶”ê°€**            | `description bb-in-A02#Gi1/0/1`                                                              | ì¸í„°í˜ì´ìŠ¤ì— ì„¤ëª…ì„ ì¶”ê°€í•˜ì—¬ ê´€ë¦¬ ìš©ì´.                                                           |
| **8ë¹„íŠ¸ ë¬¸ì ì„¸íŠ¸ í™œì„±í™”**     | `default-value exec-character-bits 8`                                                       | í•œê¸€ ë° íŠ¹ìˆ˜ ë¬¸ì ì²˜ë¦¬ë¥¼ ìœ„í•´ UTF-8 í™œì„±í™”.                                                      |
| **ë°°ë„ˆ ë©”ì‹œì§€ ì„¤ì •**          | `banner motd`                                                                                | í•œê¸€ ë° ê²½ê³  ë©”ì‹œì§€ë¥¼ í¬í•¨í•œ ë°°ë„ˆ ìƒì„±.                                                          |
| **ì„¤ì • ì €ì¥**                | `write memory`                                                                               | ì„¤ì • ë‚´ìš©ì„ ì €ì¥.                                                                                 |

---

## ì°¸ê³  ì‚¬í•­
- ìœ„ ëª…ë ¹ì–´ëŠ” **Cisco IOS** ê¸°ë°˜ ì¥ë¹„ì—ì„œ í…ŒìŠ¤íŠ¸ëœ í‘œì¤€ ì„¤ì •ì…ë‹ˆë‹¤.
- í•œê¸€ ë°°ë„ˆ ì‚¬ìš© ì‹œ ë°˜ë“œì‹œ `default-value exec-character-bits 8`ì„ ë¨¼ì € ì„¤ì •í•œ ë’¤ ì¬ë¡œê·¸ì¸í•´ì•¼ ì •ìƒ ë™ì‘í•©ë‹ˆë‹¤.
- ë³´ì•ˆ ê°•í™” ë° íš¨ìœ¨ì ì¸ ê´€ë¦¬ê°€ í•„ìš”í•  ê²½ìš° AAA ëª¨ë¸ì„ ì‚¬ìš©í•˜ëŠ” ê²ƒì´ ê¶Œì¥ë©ë‹ˆë‹¤.

## ê¸°ë³¸ ì„¤ì •

### í˜¸ìŠ¤íŠ¸ ì´ë¦„ ì„¤ì •

```bash
Switch# configure terminal
Switch(config)# hostname SW
```

### **Enable ë° ì‚¬ìš©ì ë¹„ë°€ë²ˆí˜¸ ì„¤ì •**
1. Enable ë¹„ë°€ë²ˆí˜¸ (Scrypt ì•Œê³ ë¦¬ì¦˜)

```bash
Switch(config)# enable algorithm-type scrypt secret cisco
```

2. ì‚¬ìš©ì ê³„ì • ë° ë¹„ë°€ë²ˆí˜¸

```bash
Switch(config)# username cisco privilege 15 algorithm-type scrypt secret cisco
```

### AAA ëª¨ë¸ ë¹„í™œì„±í™”

```bash
Switch(config)# no aaa new-model
```

### ë„ë©”ì¸ ì´ë¦„ ì¡°íšŒ ë¹„í™œì„±í™”

```bash
Switch(config)# no ip domain-lookup
```

### ì‹œê°„ëŒ€ ë° NTP ì„œë²„ ì„¤ì •
1. ì‹œê°„ëŒ€ ì„¤ì •

```bash
Switch(config)# clock timezone KST 9 0
```

2. NTP ì„œë²„ ì¶”ê°€

```bash
Switch(config)# ntp server 216.239.35.0
Switch(config)# ntp server 216.239.35.4
Switch(config)# ntp server 216.239.35.8
Switch(config)# ntp server 216.239.35.12
```

### ë„ë©”ì¸ ì´ë¦„ ë° SSH ì„¤ì •
1. ë„ë©”ì¸ ì´ë¦„ ì„¤ì •

```bash
Switch(config)# ip domain-name infra.com
```

2. SSH í‚¤ ìƒì„± ë° ë²„ì „ ì„¤ì •

```bash
Switch(config)# crypto key generate rsa general-keys modulus 2048
```

```bash
Switch(config)# ip ssh version 2
Switch(config)# ip ssh time-out 120
```

3. SCP í™œì„±í™”

```bash
Switch(config)# ip scp server enable
```

### SNMP ë° ACL ì„¤ì •
1. SNMP ACL ìƒì„±

```bash
Switch(config)# ip access-list standard SNMP
Switch(config-std-nacl)# permit 10.1.1.100
```

2. SNMP ì»¤ë®¤ë‹ˆí‹° ì„¤ì •

```bash
Switch(config)# snmp-server community nms RO SNMP
```

### ë¡œê¹… ì„œë²„ ì„¤ì •
1. ë¡œê¹… ì„œë²„ ì¶”ê°€

```bash
Switch(config)# logging host 10.1.1.100
```

2. ë¡œê¹… ë ˆë²¨ ì„¤ì •

```bash
Switch(config)# logging trap 7
# ë˜ëŠ”
Switch(config)# logging trap debugging
```

### VTY ë¼ì¸ ì„¤ì •
1. SSH ì ‘ê·¼ ì œí•œ ë° ë¹„í™œì„±í™” íƒ€ì´ë¨¸

```bash
Switch(config)# line vty 0 15
Switch(config-line)# transport input ssh
Switch(config-line)# login local
Switch(config-line)# exec-timeout 5 0
```

### SSH ê³µê°œ í‚¤ ë“±ë¡

```bash
Switch(config)# ip ssh pubkey-chain
Switch(conf-ssh-pubkey)# username cisco
Switch(conf-ssh-pubkey-user)# key-hash ssh-rsa 854581AA45BAD174CD00C8CEFFD1F959
```

### VLAN ì„¤ì •
1. VLAN ìƒì„± ë° ì´ë¦„ ì§€ì •

```bash
Switch(config)# vlan 100
Switch(config-vlan)# name Zone_10.1.1.0/24
```

2. VLAN ì¸í„°í˜ì´ìŠ¤ ì„¤ì •

```bash
Switch(config)# interface Vlan100
Switch(config-if)# ip address 10.1.1.10 255.255.255.0
```

### ê¸°ë³¸ ê²Œì´íŠ¸ì›¨ì´ ì„¤ì •

```bash
Switch(config)# ip default-gateway 10.1.255.1
```

### í¬íŠ¸ ë° í¬íŠ¸ ì±„ë„ ì„¤ì •
1. íŠ¸ë í¬ í¬íŠ¸ ë° í¬íŠ¸ ì±„ë„ ë³¸ë”©

```bash
Switch(config)# interface range Gi1/0/47 - 48
Switch(config-if-range)# switchport mode trunk
Switch(config-if-range)# switchport trunk allowed vlan 100
Switch(config-if-range)# channel-group 1 mode active
```

2. í¬íŠ¸ ì„¤ëª… ì¶”ê°€

```bash
Switch(config)# interface Gi1/0/47
Switch(config-if)# description bb-in-A02#Gi1/0/1
Switch(config)# interface Gi1/0/48
Switch(config-if)# description bb-in-A02#Gi2/0/1
```

3. í¬íŠ¸ ì±„ë„ ì¸í„°í˜ì´ìŠ¤ ì„¤ëª… ì¶”ê°€

```bash
Switch(config)# interface Port-channel 1
Switch(config-if)# description bb-in-A02
```

### ACL ì„¤ì •
1. ACL ì •ì±… ìˆ˜ë¦½

```bash
Switch(config)# ip access-list standard ALLOW_LOGIN
Switch(config-std-nacl)# permit 10.1.1.0 0.0.0.255
Switch(config-std-nacl)# deny any log
```

2. Login ì •ì±… ì ìš©

```bash
Switch(config)# line vty 0 15
Switch(config-line)# access-class ALLOW_LOGIN in
```

### Web UI ì ‘ê·¼ ë¹„í™œì„±í™” ì„¤ì •

```bash
Switch(config)# no ip http server
Switch(config)# no ip http secure-server
```

### ë°°ë„ˆ ë©”ì‹œì§€ ì„¤ì •
1. **8ë¹„íŠ¸ ë¬¸ì ì„¸íŠ¸(UTF-8)** í™œì„±í™”
- íŠ¹ìˆ˜ ë¬¸ìë‚˜ í•œê¸€ ê°™ì€ ë¹„ASCII ë¬¸ìë¥¼ ì •ìƒì ìœ¼ë¡œ í‘œì‹œí•˜ê³  ì²˜ë¦¬í•˜ê¸° ìœ„í•´ í•„ìˆ˜ì ì¸ ì„¤ì •.
- 7ë¹„íŠ¸ ASCII ë¬¸ìë§Œ í™œì„±í™”ëœ ê¸°ë³¸ ìƒíƒœì—ì„œëŠ” í•œê¸€ê³¼ íŠ¹ìˆ˜ ë¬¸ì ì…ë ¥ ì‹œ ì˜¤ë¥˜ ë°œìƒ.
- **8ë¹„íŠ¸ ë¬¸ì ì„¸íŠ¸(UTF-8)** í™œì„±í™” í›„ ì„¸ì…˜ ì¢…ë£Œ í›„ ë°°ë„ˆ ë“±ë¡ í•„ìˆ˜
  
```bash
Switch(config)# default-value exec-character-bits 8
Switch(config)# end
Switch# exit
```

2. ë°°ë„ˆ ë©”ì‹œì§€ ì„¤ì •

```bash
Switch(config)# banner motd ^
Enter TEXT message.  End with the character '^'.
+-----------------------------------------------------------------------+
|                                                                       |
|                        - ê²½          ê³  -                             |
|                                                                       |
|                  í•´ë‹¹ ì‹œìŠ¤í…œì— ë¹„ì¸ê°€ìì˜ ì ‘ê·¼ì€ ë¶ˆë²•ì´ë©°,            |
|                ì ‘ê·¼ì‹œ ë¯¼/í˜•ì‚¬ìƒì˜ ì²˜ë²Œì„ ë°›ì„ ìˆ˜ ìˆìŠµë‹ˆë‹¤.            |
|                                                                       |
|    í•´ë‹¹ ì‹œìŠ¤í…œì— ëª¨ë“  ì ‘ì† ì‹œë„ ë° ì ‘ì†ì— ëŒ€í•´ ìƒì‹œ ê¸°ë¡ì´ ë©ë‹ˆë‹¤.    |
|                                                                       |
|                        - W A R N I N G -                              |
|                                                                       |
|      A notice that any unathorized use of the system is unlawful,     |
|    and may be subject to civil and/or criminal penalties.             |
|                                                                       |
|      Any of your attempt to connect to the system is logged.          |
|                                                                       |
+-----------------------------------------------------------------------+
^
```

### ì„¤ì • ì €ì¥

```bash
Switch# write memory
```
